In [1]:
import pandas as pd

In [2]:
people = {
    'first':['Hussein' , 'Moataz' , 'Ekram'],
    'last' :['Sarea' , 'Ahmed' , 'Sarea'],
    'email':['zzzsdsd@dskd.com' , 'dsd@dsx.com' , 'zzz@dskd.com']
}

In [3]:
df = pd.DataFrame( data=people )
df

     first   last             email
0  Hussein  Sarea  zzzsdsd@dskd.com
1   Moataz  Ahmed       dsd@dsx.com
2    Ekram  Sarea      zzz@dskd.com

In [4]:
df['full_name'] = df['first'] + ' ' + df['last']
df

     first   last             email      full_name
0  Hussein  Sarea  zzzsdsd@dskd.com  Hussein Sarea
1   Moataz  Ahmed       dsd@dsx.com   Moataz Ahmed
2    Ekram  Sarea      zzz@dskd.com    Ekram Sarea

In [5]:
# df.drop( columns='first' )
df.drop( columns=['first' , 'last']  , inplace=True)
df

              email      full_name
0  zzzsdsd@dskd.com  Hussein Sarea
1       dsd@dsx.com   Moataz Ahmed
2      zzz@dskd.com    Ekram Sarea

In [24]:
df[ ['first' , 'last'] ] = df['full_name'].str.split(' ' , expand=True)
df

              email      full_name    first   last
0  zzzsdsd@dskd.com  Hussein Sarea  Hussein  Sarea
1       dsd@dsx.com   Moataz Ahmed   Moataz  Ahmed
2      zzz@dskd.com    Ekram Sarea    Ekram  Sarea

In [26]:
df.append( {
    'first' : 'Mike',
    'last' : 'White',
    'email' : 'zdsjshd@dshjd.com'
}  , ignore_index=True)

               email      full_name    first   last
0   zzzsdsd@dskd.com  Hussein Sarea  Hussein  Sarea
1        dsd@dsx.com   Moataz Ahmed   Moataz  Ahmed
2       zzz@dskd.com    Ekram Sarea    Ekram  Sarea
3  zdsjshd@dshjd.com            NaN     Mike  White